grevaillot/svd_tools/headers/ATSAM4SP32A/usart0.h
#pragma once 

/* --- USART0: Universal Synchronous Asynchronous Receiver Transmitter 0  */

/** @defgroup usart0_registers Universal Synchronous Asynchronous Receiver Transmitter 0 Register
@{*/

/** USART0_CR Control Register **/
#define USART0_CR			MMIO32(USART0_BASE + 0x00)
/** USART0_CR_SPI_MODE Control Register **/
#define USART0_CR_SPI_MODE			MMIO32(USART0_BASE + 0x00)
/** USART0_MR Mode Register **/
#define USART0_MR			MMIO32(USART0_BASE + 0x04)
/** USART0_MR_SPI_MODE Mode Register **/
#define USART0_MR_SPI_MODE			MMIO32(USART0_BASE + 0x04)
/** USART0_IER Interrupt Enable Register **/
#define USART0_IER			MMIO32(USART0_BASE + 0x08)
/** USART0_IER_SPI_MODE Interrupt Enable Register **/
#define USART0_IER_SPI_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_IDR Interrupt Disable Register **/
#define USART0_IDR			MMIO32(USART0_BASE + 0x0c)
/** USART0_IDR_SPI_MODE Interrupt Disable Register **/
#define USART0_IDR_SPI_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_IMR Interrupt Mask Register **/
#define USART0_IMR			MMIO32(USART0_BASE + 0x10)
/** USART0_IMR_SPI_MODE Interrupt Mask Register **/
#define USART0_IMR_SPI_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_CSR Channel Status Register **/
#define USART0_CSR			MMIO32(USART0_BASE + 0x14)
/** USART0_CSR_SPI_MODE Channel Status Register **/
#define USART0_CSR_SPI_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_RHR Receiver Holding Register **/
#define USART0_RHR			MMIO32(USART0_BASE + 0x18)
/** USART0_THR Transmitter Holding Register **/
#define USART0_THR			MMIO32(USART0_BASE + 0x1c)
/** USART0_BRGR Baud Rate Generator Register **/
#define USART0_BRGR			MMIO32(USART0_BASE + 0x20)
/** USART0_RTOR Receiver Time-out Register **/
#define USART0_RTOR			MMIO32(USART0_BASE + 0x24)
/** USART0_TTGR Transmitter Timeguard Register **/
#define USART0_TTGR			MMIO32(USART0_BASE + 0x28)
/** USART0_FIDI FI DI Ratio Register **/
#define USART0_FIDI			MMIO32(USART0_BASE + 0x40)
/** USART0_NER Number of Errors Register **/
#define USART0_NER			MMIO32(USART0_BASE + 0x44)
/** USART0_IF IrDA Filter Register **/
#define USART0_IF			MMIO32(USART0_BASE + 0x4c)
/** USART0_MAN Manchester Encoder Decoder Register **/
#define USART0_MAN			MMIO32(USART0_BASE + 0x50)
/** USART0_WPMR Write Protect Mode Register **/
#define USART0_WPMR			MMIO32(USART0_BASE + 0xe4)
/** USART0_WPSR Write Protect Status Register **/
#define USART0_WPSR			MMIO32(USART0_BASE + 0xe8)
/** USART0_VERSION Version Register **/
#define USART0_VERSION			MMIO32(USART0_BASE + 0xfc)
/** USART0_RPR Receive Pointer Register **/
#define USART0_RPR			MMIO32(USART0_BASE + 0x100)
/** USART0_RCR Receive Counter Register **/
#define USART0_RCR			MMIO32(USART0_BASE + 0x104)
/** USART0_TPR Transmit Pointer Register **/
#define USART0_TPR			MMIO32(USART0_BASE + 0x108)
/** USART0_TCR Transmit Counter Register **/
#define USART0_TCR			MMIO32(USART0_BASE + 0x10c)
/** USART0_RNPR Receive Next Pointer Register **/
#define USART0_RNPR			MMIO32(USART0_BASE + 0x110)
/** USART0_RNCR Receive Next Counter Register **/
#define USART0_RNCR			MMIO32(USART0_BASE + 0x114)
/** USART0_TNPR Transmit Next Pointer Register **/
#define USART0_TNPR			MMIO32(USART0_BASE + 0x118)
/** USART0_TNCR Transmit Next Counter Register **/
#define USART0_TNCR			MMIO32(USART0_BASE + 0x11c)
/** USART0_PTCR Transfer Control Register **/
#define USART0_PTCR			MMIO32(USART0_BASE + 0x120)
/** USART0_PTSR Transfer Status Register **/
#define USART0_PTSR			MMIO32(USART0_BASE + 0x124)

/**@}*/


/** @defgroup usart0_cr CR Control Register
@{*/

/** USART0_CR_RTSDIS Request to Send Disable **/
#define USART0_CR_RTSDIS		(1 << 19)
/** USART0_CR_RTSEN Request to Send Enable **/
#define USART0_CR_RTSEN		(1 << 18)
/** USART0_CR_RETTO Rearm Time-out **/
#define USART0_CR_RETTO		(1 << 15)
/** USART0_CR_RSTNACK Reset Non Acknowledge **/
#define USART0_CR_RSTNACK		(1 << 14)
/** USART0_CR_RSTIT Reset Iterations **/
#define USART0_CR_RSTIT		(1 << 13)
/** USART0_CR_SENDA Send Address **/
#define USART0_CR_SENDA		(1 << 12)
/** USART0_CR_STTTO Start Time-out **/
#define USART0_CR_STTTO		(1 << 11)
/** USART0_CR_STPBRK Stop Break **/
#define USART0_CR_STPBRK		(1 << 10)
/** USART0_CR_STTBRK Start Break **/
#define USART0_CR_STTBRK		(1 << 9)
/** USART0_CR_RSTSTA Reset Status Bits **/
#define USART0_CR_RSTSTA		(1 << 8)
/** USART0_CR_TXDIS Transmitter Disable **/
#define USART0_CR_TXDIS		(1 << 7)
/** USART0_CR_TXEN Transmitter Enable **/
#define USART0_CR_TXEN		(1 << 6)
/** USART0_CR_RXDIS Receiver Disable **/
#define USART0_CR_RXDIS		(1 << 5)
/** USART0_CR_RXEN Receiver Enable **/
#define USART0_CR_RXEN		(1 << 4)
/** USART0_CR_RSTTX Reset Transmitter **/
#define USART0_CR_RSTTX		(1 << 3)
/** USART0_CR_RSTRX Reset Receiver **/
#define USART0_CR_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart0_cr_spi_mode CRSPIMODE Control Register
@{*/

/** USART0_CR_SPI_MODE_RCS Release SPI Chip Select **/
#define USART0_CR_SPI_MODE_RCS		(1 << 19)
/** USART0_CR_SPI_MODE_FCS Force SPI Chip Select **/
#define USART0_CR_SPI_MODE_FCS		(1 << 18)
/** USART0_CR_SPI_MODE_RSTSTA Reset Status Bits **/
#define USART0_CR_SPI_MODE_RSTSTA		(1 << 8)
/** USART0_CR_SPI_MODE_TXDIS Transmitter Disable **/
#define USART0_CR_SPI_MODE_TXDIS		(1 << 7)
/** USART0_CR_SPI_MODE_TXEN Transmitter Enable **/
#define USART0_CR_SPI_MODE_TXEN		(1 << 6)
/** USART0_CR_SPI_MODE_RXDIS Receiver Disable **/
#define USART0_CR_SPI_MODE_RXDIS		(1 << 5)
/** USART0_CR_SPI_MODE_RXEN Receiver Enable **/
#define USART0_CR_SPI_MODE_RXEN		(1 << 4)
/** USART0_CR_SPI_MODE_RSTTX Reset Transmitter **/
#define USART0_CR_SPI_MODE_RSTTX		(1 << 3)
/** USART0_CR_SPI_MODE_RSTRX Reset Receiver **/
#define USART0_CR_SPI_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart0_mr MR Mode Register
@{*/

/** USART0_MR_ONEBIT Start Frame Delimiter Selector **/
#define USART0_MR_ONEBIT		(1 << 31)
/** USART0_MR_MODSYNC Manchester Synchronization Mode **/
#define USART0_MR_MODSYNC		(1 << 30)
/** USART0_MR_MAN Manchester Encoder/Decoder Enable **/
#define USART0_MR_MAN		(1 << 29)
/** USART0_MR_FILTER Infrared Receive Line Filter **/
#define USART0_MR_FILTER		(1 << 28)

#define USART0_MR_MAX_ITERATION_SHIFT		24
#define USART0_MR_MAX_ITERATION_MASK		0x07
/** @defgroup usart0_mr_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART0_MR_INVDATA Inverted Data **/
#define USART0_MR_INVDATA		(1 << 23)
/** USART0_MR_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART0_MR_VAR_SYNC		(1 << 22)
/** USART0_MR_DSNACK Disable Successive NACK **/
#define USART0_MR_DSNACK		(1 << 21)
/** USART0_MR_INACK Inhibit Non Acknowledge **/
#define USART0_MR_INACK		(1 << 20)
/** USART0_MR_OVER Oversampling Mode **/
#define USART0_MR_OVER		(1 << 19)
/** USART0_MR_CLKO Clock Output Select **/
#define USART0_MR_CLKO		(1 << 18)
/** USART0_MR_MODE9 9-bit Character Length **/
#define USART0_MR_MODE9		(1 << 17)
/** USART0_MR_MSBF Bit Order **/
#define USART0_MR_MSBF		(1 << 16)

#define USART0_MR_CHMODE_SHIFT		14
#define USART0_MR_CHMODE_MASK		0x03
/** @defgroup usart0_mr_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART0_MR_NBSTOP_SHIFT		12
#define USART0_MR_NBSTOP_MASK		0x03
/** @defgroup usart0_mr_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART0_MR_PAR_SHIFT		9
#define USART0_MR_PAR_MASK		0x07
/** @defgroup usart0_mr_par PAR Parity Type
@{*/
/**@}*/

/** USART0_MR_SYNC Synchronous Mode Select **/
#define USART0_MR_SYNC		(1 << 8)

