grevaillot/svd_tools/headers/ATSAM4SP32A/usart0.h
/** @defgroup usart0_imr_spi_mode IMRSPIMODE Interrupt Mask Register
@{*/

/** USART0_IMR_SPI_MODE_UNRE SPI Underrun Error Interrupt Mask **/
#define USART0_IMR_SPI_MODE_UNRE		(1 << 10)
/** USART0_IMR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_IMR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_IMR_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_IMR_SPI_MODE_OVRE		(1 << 5)
/** USART0_IMR_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_IMR_SPI_MODE_TXRDY		(1 << 1)
/** USART0_IMR_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_IMR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_csr CSR Channel Status Register
@{*/

/** USART0_CSR_MANERR Manchester Error **/
#define USART0_CSR_MANERR		(1 << 24)
/** USART0_CSR_CTS Image of CTS Input **/
#define USART0_CSR_CTS		(1 << 23)
/** USART0_CSR_CTSIC Clear to Send Input Change Flag **/
#define USART0_CSR_CTSIC		(1 << 19)
/** USART0_CSR_NACK Non AcknowledgeInterrupt **/
#define USART0_CSR_NACK		(1 << 13)
/** USART0_CSR_RXBUFF Reception Buffer Full **/
#define USART0_CSR_RXBUFF		(1 << 12)
/** USART0_CSR_TXBUFE Transmission Buffer Empty **/
#define USART0_CSR_TXBUFE		(1 << 11)
/** USART0_CSR_ITER MaxNumber of Repetitions Reached **/
#define USART0_CSR_ITER		(1 << 10)
/** USART0_CSR_TXEMPTY Transmitter Empty **/
#define USART0_CSR_TXEMPTY		(1 << 9)
/** USART0_CSR_TIMEOUT Receiver Time-out **/
#define USART0_CSR_TIMEOUT		(1 << 8)
/** USART0_CSR_PARE Parity Error **/
#define USART0_CSR_PARE		(1 << 7)
/** USART0_CSR_FRAME Framing Error **/
#define USART0_CSR_FRAME		(1 << 6)
/** USART0_CSR_OVRE Overrun Error **/
#define USART0_CSR_OVRE		(1 << 5)
/** USART0_CSR_ENDTX End of Transmitter Transfer **/
#define USART0_CSR_ENDTX		(1 << 4)
/** USART0_CSR_ENDRX End of Receiver Transfer **/
#define USART0_CSR_ENDRX		(1 << 3)
/** USART0_CSR_RXBRK Break Received/End of Break **/
#define USART0_CSR_RXBRK		(1 << 2)
/** USART0_CSR_TXRDY Transmitter Ready **/
#define USART0_CSR_TXRDY		(1 << 1)
/** USART0_CSR_RXRDY Receiver Ready **/
#define USART0_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_csr_spi_mode CSRSPIMODE Channel Status Register
@{*/

/** USART0_CSR_SPI_MODE_UNRE Underrun Error **/
#define USART0_CSR_SPI_MODE_UNRE		(1 << 10)
/** USART0_CSR_SPI_MODE_TXEMPTY Transmitter Empty **/
#define USART0_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_CSR_SPI_MODE_OVRE Overrun Error **/
#define USART0_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART0_CSR_SPI_MODE_TXRDY Transmitter Ready **/
#define USART0_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART0_CSR_SPI_MODE_RXRDY Receiver Ready **/
#define USART0_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_rhr RHR Receiver Holding Register
@{*/

/** USART0_RHR_RXSYNH Received Sync **/
#define USART0_RHR_RXSYNH		(1 << 15)

#define USART0_RHR_RXCHR_SHIFT		0
#define USART0_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart0_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_thr THR Transmitter Holding Register
@{*/

/** USART0_THR_TXSYNH Sync Field to be Transmitted **/
#define USART0_THR_TXSYNH		(1 << 15)

#define USART0_THR_TXCHR_SHIFT		0
#define USART0_THR_TXCHR_MASK		0x1ff
/** @defgroup usart0_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_brgr BRGR Baud Rate Generator Register
@{*/


#define USART0_BRGR_FP_SHIFT		16
#define USART0_BRGR_FP_MASK		0x07
/** @defgroup usart0_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART0_BRGR_CD_SHIFT		0
#define USART0_BRGR_CD_MASK		0xffff
/** @defgroup usart0_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rtor RTOR Receiver Time-out Register
@{*/


#define USART0_RTOR_TO_SHIFT		0
#define USART0_RTOR_TO_MASK		0xffff
/** @defgroup usart0_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ttgr TTGR Transmitter Timeguard Register
@{*/


#define USART0_TTGR_TG_SHIFT		0
#define USART0_TTGR_TG_MASK		0xff
/** @defgroup usart0_ttgr_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_fidi FIDI FI DI Ratio Register
@{*/


#define USART0_FIDI_FI_DI_RATIO_SHIFT		0
#define USART0_FIDI_FI_DI_RATIO_MASK		0x7ff
/** @defgroup usart0_fidi_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ner NER Number of Errors Register
@{*/


#define USART0_NER_NB_ERRORS_SHIFT		0
#define USART0_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart0_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_if IF IrDA Filter Register
@{*/


#define USART0_IF_IRDA_FILTER_SHIFT		0
#define USART0_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart0_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_man MAN Manchester Encoder Decoder Register
@{*/

/** USART0_MAN_DRIFT Drift Compensation **/
#define USART0_MAN_DRIFT		(1 << 30)
/** USART0_MAN_ONE Must Be Set to 1 **/
#define USART0_MAN_ONE		(1 << 29)
/** USART0_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART0_MAN_RX_MPOL		(1 << 28)

#define USART0_MAN_RX_PP_SHIFT		24
#define USART0_MAN_RX_PP_MASK		0x03
/** @defgroup usart0_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART0_MAN_RX_PL_SHIFT		16
#define USART0_MAN_RX_PL_MASK		0x0f
/** @defgroup usart0_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART0_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART0_MAN_TX_MPOL		(1 << 12)

#define USART0_MAN_TX_PP_SHIFT		8
#define USART0_MAN_TX_PP_MASK		0x03
/** @defgroup usart0_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART0_MAN_TX_PL_SHIFT		0
#define USART0_MAN_TX_PL_MASK		0x0f
/** @defgroup usart0_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_wpmr WPMR Write Protect Mode Register
@{*/


#define USART0_WPMR_WPKEY_SHIFT		8
#define USART0_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart0_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** USART0_WPMR_WPEN Write Protect Enable **/
#define USART0_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart0_wpsr WPSR Write Protect Status Register
@{*/


#define USART0_WPSR_WPVSRC_SHIFT		8
#define USART0_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart0_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** USART0_WPSR_WPVS Write Protect Violation Status **/
#define USART0_WPSR_WPVS		(1 << 0)

/**@}*/

