grevaillot/svd_tools/headers/ATSAM4SP32A/usart0.h
/** @defgroup usart0_version VERSION Version Register
@{*/


#define USART0_VERSION_MFN_SHIFT		16
#define USART0_VERSION_MFN_MASK		0x07
/** @defgroup usart0_version_mfn MFN Metal Fix Number
@{*/
/**@}*/


#define USART0_VERSION_VERSION_SHIFT		0
#define USART0_VERSION_VERSION_MASK		0xfff
/** @defgroup usart0_version_version VERSION Harware Module Version
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rpr RPR Receive Pointer Register
@{*/


#define USART0_RPR_RXPTR_SHIFT		0
#define USART0_RPR_RXPTR_MASK		0xffffffff
/** @defgroup usart0_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rcr RCR Receive Counter Register
@{*/


#define USART0_RCR_RXCTR_SHIFT		0
#define USART0_RCR_RXCTR_MASK		0xffff
/** @defgroup usart0_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tpr TPR Transmit Pointer Register
@{*/


#define USART0_TPR_TXPTR_SHIFT		0
#define USART0_TPR_TXPTR_MASK		0xffffffff
/** @defgroup usart0_tpr_txptr TXPTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tcr TCR Transmit Counter Register
@{*/


#define USART0_TCR_TXCTR_SHIFT		0
#define USART0_TCR_TXCTR_MASK		0xffff
/** @defgroup usart0_tcr_txctr TXCTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rnpr RNPR Receive Next Pointer Register
@{*/


#define USART0_RNPR_RXNPTR_SHIFT		0
#define USART0_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup usart0_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rncr RNCR Receive Next Counter Register
@{*/


#define USART0_RNCR_RXNCTR_SHIFT		0
#define USART0_RNCR_RXNCTR_MASK		0xffff
/** @defgroup usart0_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tnpr TNPR Transmit Next Pointer Register
@{*/


#define USART0_TNPR_TXNPTR_SHIFT		0
#define USART0_TNPR_TXNPTR_MASK		0xffffffff
/** @defgroup usart0_tnpr_txnptr TXNPTR Transmit Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tncr TNCR Transmit Next Counter Register
@{*/


#define USART0_TNCR_TXNCTR_SHIFT		0
#define USART0_TNCR_TXNCTR_MASK		0xffff
/** @defgroup usart0_tncr_txnctr TXNCTR Transmit Counter Next
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ptcr PTCR Transfer Control Register
@{*/

/** USART0_PTCR_TXTDIS Transmitter Transfer Disable **/
#define USART0_PTCR_TXTDIS		(1 << 9)
/** USART0_PTCR_TXTEN Transmitter Transfer Enable **/
#define USART0_PTCR_TXTEN		(1 << 8)
/** USART0_PTCR_RXTDIS Receiver Transfer Disable **/
#define USART0_PTCR_RXTDIS		(1 << 1)
/** USART0_PTCR_RXTEN Receiver Transfer Enable **/
#define USART0_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup usart0_ptsr PTSR Transfer Status Register
@{*/

/** USART0_PTSR_TXTEN Transmitter Transfer Enable **/
#define USART0_PTSR_TXTEN		(1 << 8)
/** USART0_PTSR_RXTEN Receiver Transfer Enable **/
#define USART0_PTSR_RXTEN		(1 << 0)

/**@}*/
